// 제조사 검색

export function getOriginList(value) {
  switch (value) {
    case "국산":
      return ["현대", "기아", "대우", "삼성", "쌍용", "제네시스", "쉐보레"];
    case "수입":
      return [
        "벤츠",
        "BMW",
        "아우디",
        "폭스바겐",
        "포르쉐",
        "마이바흐",
        "렉서스",
        "혼다",
        "닛산",
        "인피니티",
        "토요타",
        "링컨",
        "포드",
        "캐딜락",
        "다찌",
        "허머",
        "테슬라",
        "볼보",
        "푸조",
        "재규어",
        "지프",
        "랜드로버",
        "로버",
        "벤틀리",
        "미니",
        "애스턴마틴",
        "롤스로이스",
        "마세라티",
        "알파로메오",
        "폰티악",
        "시보레",
        "로터스",
        "부가티",
        "동풍소콘",
        "피아트",
      ];
    case "화물":
      return [
        "고소",
        "덤프",
        "렉카",
        "로리",
        "압축진개",
        "카고",
        "탑차",
        "트랙터",
        "트레일러",
        "특수",
        "활어차",
      ];

    default:
      return;
  }
}

// 시리즈 검색

export function getSeriesList(value) {
  switch (value) {
    case "현대":
      return [
        "i30",
        "i40",
        "갤로퍼",
        "그랜저",
        "소나타",
        "그레이스",
        "넥쏘",
        "다이너스티",
        "라비타",
        "리베로",
        "맥스크루즈",
        "베뉴",
        "베라크루즈",
        "베르나",
        "벨로스터",
        "솔라티",
        "스쿠프",
        "스타렉스",
        "스타리아",
        "스텔라",
        "싼타모",
        "싼타페",
        "아반뗴",
        "아슬란",
        "아이오닉",
        "아토스",
        "에쿠스",
        "엑센트",
        "엑셀",
        "엘란트라",
        "제네시스",
        "캐스퍼",
        "코나",
        "투싼",
        "투스카니",
        "펠리세이드",
        "포니",
        "포터",
      ];
    case "기아":
      return [
        "EV6",
        "K3",
        "K5",
        "K7",
        "K8",
        "K9",
        "니로",
        "레이",
        "레토나",
        "로체",
        "록스타",
        "리오",
        "모닝",
        "모하비",
        "베스타",
        "봉고3",
        "셀토스",
        "스토닉",
        "스팅어",
        "스포티지",
        "쎼라토",
        "쏘렌토",
        "쏘울",
        "아벨라",
        "엑스트렉",
        "엔터프라이즈",
        "오피러스",
        "옵티마",
        "카니발",
        "카렌스",
        "포르테",
        "포텐샤",
        "프라이드",
      ];
    case "대우":
      return [
        "G2X",
        "넥시아",
        "누비라",
        "다마스",
        "라노스",
        "라보",
        "라세티",
        "레간자",
        "레조",
        "르망",
        "마티즈",
        "매그너스",
        "알페온",
        "윈스톰",
        "젠트라",
        "토스카",
        "티코",
      ];
    case "삼성":
      return ["QM3", "QM5", "QM6", "SM3", "SM5", "SM6", "SM7", "XM3", "마스터"];
    case "쌍용":
      return [
        "렉스턴",
        "로디우스",
        "무쏘",
        "액티언",
        "체어맨",
        "카리스타",
        "코란도",
        "티볼리",
        "카이런",
      ];
    case "제네시스":
      return ["EQ900", "G70", "G80", "G90", "GV60", "GV70", "GV80"];
    case "쉐보레":
      return [
        "말리부",
        "볼트",
        "스파크",
        "아베오",
        "올란도",
        "아쿼녹스",
        "임팔라",
        "카마로",
        "캡티바",
        "콜로라도",
        "콜벳",
        "크루즈",
        "트랙스",
        "트레일블레이저",
      ];
    case "벤츠":
      return [
        "A Class",
        "B Class",
        "C Class",
        "E Class",
        "G Class",
        "S Class",
        "AMG GT",
        "EQA",
        "EQC",
        "GLB",
        "GLE",
        "GLS",
        "SLC",
        "SLR",
        "CL",
        "CLA",
        "CLK",
        "CLS",
        "GL",
        "GLA",
        "GLC",
        "GLK",
        "M",
        "R",
        "SL",
        "SLK",
        "SLS",
      ];
    case "BMW":
      return [
        "BMW 1",
        "BMW 2",
        "BMW 3",
        "BMW 4",
        "BMW 5",
        "BMW 6",
        "BMW 7",
        "BMW 8",
        "BMW i3",
        "BMW i8",
        "BMW X1",
        "BMW X2",
        "BMW X3",
        "BMW X4",
        "BMW X5",
        "BMW X6",
        "BMW X7",
        "BMW Z3",
        "BMW Z4",
        "BMW Z8",
        "BMW그란투리스모",
        "M",
      ];
    case "아우디":
      return [
        "e-트론",
        "Q2",
        "A1",
        "A3",
        "A4",
        "A5",
        "A6",
        "A7",
        "A8",
        "Q3",
        "Q5",
        "Q7",
        "Q8",
        "R8",
        "TT",
      ];
    case "폭스바겐":
      return [
        "CC",
        "EOS",
        "골프",
        "루탄",
        "벤토",
        "보라",
        "비틀",
        "사란",
        "시로코",
        "아테온",
        "아틀라스",
        "제타",
        "루아렉",
        "티구안",
        "티록",
        "파사트",
        "폴로",
      ];
    case "포르쉐":
      return [
        "718",
        "911",
        "928",
        "944",
        "968",
        "마칸",
        "박스터",
        "카이맨",
        "카이엔",
        "타이칸",
        "파나메라",
      ];
    case "마이바흐":
      return ["57", "62"];
    case "렉서스":
      return [
        "CT",
        "ES",
        "GS",
        "GX",
        "IS",
        "LC",
        "LS",
        "LX",
        "NX",
        "RC",
        "RX",
        "SC",
        "UX",
      ];
    case "혼다":
      return [
        "CR-V",
        "CR-Z",
        "Fit",
        "HR-V",
        "N-BOX",
        "N-ONE",
        "S2000",
        "S660",
        "댓츠",
        "델솔",
        "라이프",
        "레전드",
        "리지라인",
        "비트",
        "스트림",
        "시빅",
        "어코드",
        "엘리먼트",
        "오딧세이",
        "인사이트",
        "인스파이어",
        "인테그라",
        "파일럿",
        "패스포트",
      ];
    case "닛산":
      return [
        "GT-R",
        "NV",
        "SX",
        "Z",
        "로그",
        "로렐",
        "리프",
        "마치",
        "맥시마",
        "모코",
        "무라노",
        "버사",
        "베르사",
        "블루버드",
        "세드릭",
        "세피로",
        "센트라",
        "시마",
        "실비아",
        "알티마",
        "엑스테라",
        "푸가",
        "프론티어",
        "휘가로",
      ];
    case "인피니티":
      return [
        "인피니티 I",
        "인피니티 EX",
        "인피니티 FX",
        "인피니티 G",
        "인피니티 JX",
        "인피니티 M",
        "인피니티 Q",
        "인피니티 QX",
      ];
    case "토요타":
      return [
        "4러너",
        "86",
        "Fj크루져",
        "iQ",
        "MR",
        "WiLL",
        "가이아",
        "노아",
        "라브4",
        "랜드크루저",
        "매트릭스",
        "벤자",
        "세콰이어",
        "셀리카",
        "소아라",
        "솔라라",
        "수프라",
        "시에나",
        "시엔타",
        "아발론",
        "알테자",
        "알파드",
        "위시",
        "체이서",
        "크라운",
        "툰드라",
        "파쏘",
        "포르테",
        "프리우스",
        "프리비아",
      ];
    case "크라이슬러":
      return [
        "180",
        "200",
        "300",
        "300M",
        "ME412",
        "PT 크루저",
        "세브링",
        "크로스파이어",
        "파이어파워",
        "퍼시피카",
        "플리머스 프라울러",
      ];
    case "포드":
      return [
        "E",
        "F",
        "포드 GT",
        "KA",
        "S-MAX",
        "레인저",
        "머스탱",
        "몬데오",
        "브롱코",
        "썬더버드",
        "윈드스타",
        "이스케이프",
        "이코노라인",
        "익스플로러",
        "익스피디션",
        "컨투어",
        "쿠가",
        "토러스",
        "트랜짓",
        "파이브 헌드레드",
        "포커스",
        "퓨전",
        "프로브",
        "프리스타일",
        "피에스타",
      ];
    case "링컨":
      return [
        "LS",
        "MKC",
        "MKS",
        "MKT",
        "MKX",
        "MKZ",
        "네비게이터",
        "노틸러스",
        "에비에이터",
        "링컨 컨티넨탈",
        "코세어",
      ];
    case "캐딜락":
      return [
        "ATS",
        "BLS",
        "CT4",
        "CT5",
        "CT6",
        "CTS-V",
        "CTS",
        "DTS",
        "SRX",
        "STS",
        "XLR",
        "XT4",
        "XT5",
        "XT6",
        "XTS",
        "드빌",
        "스빌",
        "에스컬레이드",
      ];
    case "시보레":
      return ["카마로", "콜로라도", "콜벳", "타호", "트랙커"];
    case "다찌":
      return [
        "니트로",
        "다코타",
        "듀랑고",
        "램밴",
        "램픽업",
        "매그넘",
        "바이퍼",
        "밴",
        "어벤저",
        "차저",
        "챌린저",
        "캐러밴",
        "캘리버",
      ];
    case "허머":
      return ["H1", "H2", "H3"];
    case "GMC":
      return [
        "벤츄라",
        "사바나",
        "사파리",
        "소노마",
        "시에라",
        "엔보이",
        "유콘",
        "지미",
        "캐니언",
        "터레인",
      ];
    case "폰티악":
      return [
        "그랑프리",
        "그랜드 앰",
        "보네빌",
        "선파이어",
        "솔스티스",
        "토렌트",
        "트랜스포트",
      ];
    case "지프":
      return [
        "글래디에이터",
        "랭글러",
        "레니게이드",
        "리버티",
        "체로키",
        "커맨더",
        "컴패스",
      ];
    case "테슬라":
      return ["모델3", "모델S", "모델X", "모델Y"];
    case "볼보":
      return [
        "740",
        "760",
        "850",
        "940",
        "960",
        "C30",
        "C70",
        "S40",
        "S60",
        "S70",
        "S80",
        "S90",
        "V40",
        "V50",
        "V60",
        "V70",
        "V90",
        "XC40",
        "XC60",
        "XC70",
        "XC90",
      ];
    case "푸조":
      return [
        "1007",
        "107",
        "2008",
        "205",
        "206",
        "207",
        "208",
        "3008",
        "306",
        "307",
        "308",
        "405",
        "406",
        "407",
        "5008",
        "508",
        "607",
        "807",
        "RCZ",
        "익스퍼트",
      ];
    case "르노":
      return [
        "라구나",
        "메간",
        "모뒤스",
        "벨사티스",
        "세닉",
        "에스빠스",
        "조에",
        "캡처",
        "클리오",
        "트윙고",
      ];
    case "재규어":
      return [
        "E PACE",
        "F PACE",
        "F TYPE",
        "I PACE",
        "S TYPE",
        "X TYPE",
        "다임러",
        "소버린",
        "XE",
        "XF",
        "XJ",
        "XK",
      ];
    case "미니":
      return [
        "로버미니",
        "컨트리맨",
        "쿠퍼",
        "쿠퍼 로드스터",
        "쿠퍼 컨버터블",
        "미니 쿠페",
        "클럽맨",
        "페이스맨",
      ];

    case "랜드로버":
      return [
        "디스커버리",
        "디펜더",
        "레인지로버",
        "벨라",
        "스포츠",
        "이보크",
        "프리랜더",
      ];
    case "벤틀리":
      return [
        "뮬산",
        "벤테이가",
        "브룩랜즈",
        "아르나지",
        "아주르",
        "에이트",
        "컨티넨탈",
        "플라잉스퍼",
      ];
    case "로터스":
      return ["2 Eleven", "에보라", "에스프리", "엑시지", "엘리스", "유로파"];
    case "로버":
      return ["75", "MGF", "미니"];
    case "애스턴마틴":
      return ["DB", "DBS", "DBX", "라피드", "밴티지", "뱅퀴시"];
    case "롤스로이스":
      return [
        "고스트",
        "던",
        "레이스",
        "실버 셰라프",
        "실버스퍼",
        "컬리넌",
        "코니쉬",
        "팬텀",
      ];
    case "맥라렌":
      return [
        "540C",
        "570GT",
        "570S",
        "600LT",
        "650S",
        "675LT",
        "720S",
        "맥라렌 GT",
        "MP4-12C",
      ];
    case "람보르기니":
      return [
        "가야르도",
        "디아블로",
        "레벤톤",
        "무르시엘라고",
        "아벤타도르",
        "우라칸",
        "우르스",
      ];
    case "마세라티":
      return [
        "3200 GT",
        "4200 GT",
        "MC12",
        "그란스포츠",
        "그란카브리오",
        "그란투리스모",
        "기블리",
        "르반뗴",
        "스파이더",
        "콰트로포르테",
        "마세라티 쿠페",
      ];
    case "부가티":
      return ["베이론", "시론"];
    case "알파로메오":
      return [
        "147",
        "156",
        "159",
        "164",
        "166",
        "4C",
        "8C",
        "알파로메오 GT",
        "알파로메오 GTV",
        "미토",
        "브레라",
        "스파이더",
        "줄리아",
        "",
      ];
    case "페라리":
      return [
        "250GTO",
        "348",
        "360",
        "456",
        "458",
        "488",
        "512",
        "550",
        "575M",
        "599",
        "612",
        "812슈퍼패스트",
        "F12",
        "F355",
        "F40",
        "F430",
        "F50",
        "F60",
        "F8",
        "FF",
        "GTC4 루쏘",
        "SF90",
        "라페라리",
        "로마",
        "엔초페라리",
        "캘리포니아",
        "포르토피노",
      ];
    case "동풍소콘":
      return ["C31", "C32", "C35", "K01", "SX6", "펜곤 ix5"];
    case "피아트":
      return [
        "124",
        "500",
        "500X",
        "란치아",
        "멀티피아",
        "바르게타",
        "피아트 쿠페",
        "크로마",
        "푼토",
        "프리몬트",
      ];
    case "고소":
      return ["고소작업차", "바가지차", "사다리", "집게차", "카고크레인"];
    case "덤프":
      return ["덤프"];
    case "렉카":
      return ["렉카", "셀프로더", "언더리프트"];
    case "로리":
      return ["기타액체운반", "버큠로리", "탱크로리", "홈로리"];
    case "압축진개":
      return ["암롤트럭", "진개차"];
    case "카고":
      return ["2.5톤", "2톤", "3.5톤~4톤", "4.5톤~5톤", "5.5이상"];
    case "탑차":
      return [
        "냉장탑",
        "냉동탑",
        "내장탑",
        "보냉탑",
        "윙바디",
        "익스탑",
        "파워게이트",
        "하이내장탑",
      ];
    case "트랙터":
      return ["트랙터"];
    case "트레일러":
      return ["캠핑운송트레일러", "콘테이너샤시", "트레일러"];
    case "특수":
      return [
        "가축운반차",
        "곡물수송차",
        "문서파쇄압축차량",
        "방제차",
        "사료운반차",
        "왕겨및톱밥운송",
        "음식물처리차량",
        "이동목욕차",
        "이동세탁차",
        "청소차",
        "카캐리어",
        "캠핑카",
      ];
    case "압축진개":
      return ["활어차"];
    default:
      return [value];
  }
}

// 모델 검색

export function getModelList(value) {
  switch (value) {
    case "i30":
      return [value, "i30(PD)", "i30CW", "뉴 i30", "더뉴i30"];
    case "i40":
      return [value, "i40Saloon", "더뉴i40", "더뉴i40Saloon"];
    case "갤로퍼":
      return [value, "갤로퍼2", "갤로퍼2밴", "갤로퍼밴"];
    case "그랜저":
      return [
        value,
        "그랜저IG 하이브리드",
        "그랜저HG",
        "그랜저IG",
        "그랜저TG",
        "그랜저TG뉴럭셔리",
        "그랜저XG",
        "뉴그랜저",
        "뉴그랜저XG",
        "더 뉴 그랜저IG",
        "더 뉴 그랜저IG 하이브리드",
        "더 럭셔리그렌저",
      ];
    case "그레이스":
      return [value, "그레이스밴"];
    case "맥스크루즈":
      return [value, "더뉴맥스크루즈"];
    case "베르나":
      return [value, "뉴베르나", "베르나트랜스폼"];
    case "벨로스터":
      return [value, "더뉴벨로스터", "벨로스터(JS)"];
    case "소나타":
      return [
        "EF",
        "LF",
        "LF PHEV",
        "LF 하이브리드",
        "NF",
        "NF 트랜스폼",
        "YF",
        "뉴EF",
        "하이브리드(DN8)",
        "소나타(DN8)",
        "소나타2",
        "소나타3",
        "소나타뉴라이즈",
        "뉴라이즈 하이브리드",
        "더브릴리언트",
      ];
    case "스타렉스":
      return ["그랜드스타렉스", "더뉴그랜드스타렉스", value];
    case "싼타페":
      return ["더 뉴 싼타페", value, "더 프라임", "CM", "DM", "TM", "더스타일"];
    case "아반뗴":
      return [
        "뉴아반떼XD",
        "더 뉴 아반떼",
        "더뉴아반뗴AD",
        "하이브리드",
        "하이브리드(CN7)",
        "아반떼(CN7)",
        "AD",
        "MD",
        "XD",
        "HD",
        "올뉴아반떼",
      ];
    case "아이오닉":
      return ["더뉴아이오닉", "일렉트릭", "플러그인", value, "아이오닉 5"];
    case "제네시스":
      return ["더뉴제네시스쿠페", "EQ900", "DH", "G", "쿠페"];
    case "코나":
      return ["더뉴코나", "더뉴코나하이브리드", "일렉트릭", "코나 하이브리드"];
    case "투싼":
      return ["뉴 투싼iX", "올뉴투싼", "투싼(NX4)", "투싼iX", "하이브리드"];
    case "포터":
      return ["뉴포터", value, "포터2", "일렉트릭", "포레스트"];
    case "K3":
      return [
        value,
        "유로",
        "쿠페",
        "더뉴",
        "더뉴 2세대",
        "더뉴 유로",
        "더뉴 쿠페",
        "올뉴",
      ];
    case "K5":
      return [
        value,
        "3세대",
        "MX",
        "SX",
        "하이브리드",
        "하이브리드 2세대",
        "하이브리드 3세대",
        "더뉴 하이브리드",
        "더뉴",
        "더뉴 2세대",
      ];
    case "K7":
      return [
        value,
        "프리미어",
        "프리미어 하이브리드",
        "하이브리드",
        "더뉴",
        "더프레스티지",
        "올뉴",
        "올뉴 하이브리드",
      ];
    case "K9":
      return [value, "더뉴 2세대", "더뉴", "더K9"];
    case "니로":
      return [value, "PHEV", "EV", "더뉴", "더뉴 플러그인"];
    case "로체":
      return [value, "어드밴스", "이노베이션"];
    case "모닝":
      return ["뉴모닝", "더뉴", "어반", "올뉴", value];
    case "모하비":
      return ["더뉴", value, "더 마스터"];
    case "스포티지":
      return [
        "뉴",
        "더 SUV",
        "더뉴R",
        "디 올 뉴",
        "디 올 뉴 하이브리드",
        "더 볼드",
        value,
        "스포티지R",
      ];
    case "쏘렌토":
      return [
        "4세대",
        "4세대 하이브리드",
        "뉴",
        "뉴R",
        "더뉴",
        value,
        "쏘렌토R",
        "올뉴",
      ];
    case "쏘울":
      return ["더뉴", value, "EV", "부스터", "부스터 EV", "올뉴"];
    case "카니발":
      return [
        "그랜드",
        "뉴",
        "더 뉴",
        "올 뉴",
        value,
        "4세대",
        "카니발2",
        "카니발R",
      ];
    case "카렌스":
      return ["뉴", "더뉴", "올뉴", value, "카렌스2"];
    case "포르테":
      return [value, "GDI", "쿠페", "쿠페GDI", "하이브리드"];
    case "프라이드":
      return ["더 뉴", "올뉴", value, "베타", "신형"];
    case "다마스":
      return ["뉴", value, "다마스2"];
    case "라세티":
      return [value, "프리미어"];
    case "마티즈":
      return [value, "클래식", "마티즈2", "크리에이티브", "올뉴"];
    case "젠트라":
      return [value, "젠트라X"];
    case "QM3":
      return [value, "더QM3"];
    case "QM5":
      return [value, "더QM5", "네오"];
    case "QM6":
      return [value, "더QM6"];
    case "SM3":
      return [value, "Z.E", "네오", "뉴"];
    case "SM5":
      return [value, "노바", "뉴임프레션", "뉴", "뉴 플래티넘"];
    case "SM6":
      return [value, "더SM6"];
    case "SM7":
      return [value, "노바", "뉴아트", "올뉴"];
    case "렉스턴":
      return [
        "G4",
        "뉴",
        "더뉴 스포츠",
        "더뉴 스포츠 칸",
        value,
        "스포츠",
        "스포츠 칸",
        "렉스턴2",
        "렉스턴W",
        "올뉴",
      ];
    case "무쏘":
      return ["뉴", value, "스포츠"];
    case "액티언":
      return [value, "스포츠"];
    case "체어맨":
      return ["뉴", "뉴W", value, "H", "H 뉴클래식", "W"];
    case "코란도":
      return [
        "뉴스타일C",
        "뉴",
        "뉴C",
        "더뉴 스포츠",
        "뷰티풀",
        "뉴훼미리",
        "지프",
        "훼미리",
        "C",
        "스포츠",
        "투리스모",
      ];
    case "티볼리":
      return ["베리 뉴", value, "아머", "에어"];
    case "말리부":
      return ["더뉴", value, "올뉴"];
    case "스파크":
      return ["더 넥스트", "더뉴", value, "EV"];
    case "카마로":
      return ["더뉴", "올뉴", value];
    case "크루즈":
      return ["어메이징 뉴", "어메이징 뉴 크루즈5", "올뉴", value, "크루즈5"];
    case "A Class":
      return [value, "W176", "W177"];
    case "C Class":
      return [value, "W205", "뉴"];
    case "CL":
      return [value, "뉴"];
    case "CLS":
      return [value, "C257", "뉴"];
    case "E Class":
      return [value, "W213", "뉴"];
    case "G Class":
      return [value, "W463b"];
    case "GL":
      return [value, "X166"];
    case "S Class":
      return [value, "W221", "W222", "W223"];
    case "BMW 1":
      return ["1-SERIES", "1M", "1시리즈(F40)", "뉴"];
    case "BMW 2":
      return ["2-SERIES", "F44", "M2"];
    case "BMW 3":
      return ["3-SERIES", "G20", "F30", "M3", "뉴"];
    case "BMW 4":
      return ["4-SERIES", "G22", "M4"];
    case "BMW 5":
      return ["5-SERIES", "G30", "M5", "뉴"];
    case "BMW 6":
      return ["6-SERIES", "M6", "뉴"];
    case "BMW 7":
      return ["7-SERIES", "G11", "뉴"];
    case "BMW 8":
      return ["8-SERIES", "G15", "M8"];
    case "BMW X3":
      return ["X3", "G01", "뉴"];
    case "BMW X4":
      return ["X3", "G02"];
    case "BMW X5":
      return ["X5", "E53", "E70", "E15", "G05"];
    case "BMW X6":
      return ["X6", "M", "F16", "G06"];
    case "BMW Z4":
      return ["Z4", "G29", "뉴"];
    case "BMW그란투리스모":
      return ["3시리즈GT", "6시리즈GT", "그란투리스모"];
    case "A3":
      return [value, "RS3", "S3", "뉴"];
    case "A4":
      return [value, "RS4", "S4", "뉴", "뉴S4", ""];
    case "A5":
      return [value, "RS5", "S5"];
    case "A6":
      return [value, "RS6", "S6", "뉴"];
    case "A7":
      return [value, "RS7", "S7"];
    case "A8":
      return [value, "S8", "뉴"];
    case "Q5":
      return [value, "SQ5"];
    case "Q7":
      return [value, "SQ7"];
    case "Q8":
      return [value, "RSQ8", "SQ8"];
    case "TT":
      return [value, "TTRS", "TTS", "뉴"];
    case "골프":
      return ["1세대", "2세대", "3세대", "4세대", "5세대", "6세대", "7세대"];
    case "제타":
      return ["뉴", "올뉴", value];
    case "투아렉":
      return ["뉴", value, "3세대"];
    case "티구안":
      return [value, "뉴", "올스페이스", "2세대"];
    case "파사트":
      return ["뉴", "더뉴", value, "바리안트", "GT"];
    case "718":
      return ["박스터", "카이맨"];
    case "911":
      return [value, "992"];
    case "카이엔":
      return ["뉴", value];
    case "파나메라":
      return [value, "971"];
    case "57":
      return [value, "제플린", "57s"];
    case "62":
      return [value, "제플린", "62s", "62s 렌들렛"];
    case "CT":
      return [value, "뉴"];
    case "ES":
      return ["ES300", "ES300h 7세대", "ES330", "ES350", "뉴ES300h", "뉴ES350"];
    case "GS":
      return [
        "GS300",
        "GS350",
        "GS400",
        "GS430",
        "GS450h",
        "GS460",
        "뉴GS F",
        "뉴GS200t",
        "뉴GS250",
        "뉴GS300",
        "뉴GS350",
        "뉴GS450h",
      ];
    case "GX":
      return ["GX460", "GX470"];
    case "IS":
      return [
        "IS F",
        "IS200",
        "IS250",
        "IS300",
        "IS350",
        "뉴IS200t",
        "뉴IS250",
        "뉴IS300",
      ];
    case "LC":
      return ["LC500", "LC500h"];
    case "LS":
      return [
        value,
        "LS400",
        "LS430",
        "LS460",
        "LS460L",
        "LS500",
        "LS500h",
        "LS600hL",
      ];
    case "LX":
      return ["LX470", "LX570"];
    case "NX":
      return ["NX200t", "NX300", "NX300h"];
    case "RC":
      return ["RC F", "RC200t", "RX300", "RC350"];
    case "RX":
      return [
        "RX-7",
        "RX-8",
        "RX300",
        "RX330",
        "RX350",
        "RX400h",
        "RX450h",
        "RX450hL",
      ];
    case "SC":
      return ["SC300", "SC430"];
    case "레전드":
      return [value, "4세대", "5세대"];
    case "SX":
      return ["180SX", "200SX", "240SX"];
    case "Z":
      return ["300ZX", "350Z", "37-Z", "페어레이디"];
    case "인피니티 G":
      return ["G25", "G35", "G37"];
    case "인피니티 M":
      return ["M30d", "M35", "M37", "M45", "M56"];
    case "인피니티 Q":
      return ["Q30", "Q45", "Q50", "Q60", "Q70"];
    case "인피니티 QX":
      return ["QX30", "QX4", "QX50", "QX56", "QX60", "QX70", "QX80"];
    case "200":
      return ["200(1세대)", "2세대", "컨버터블"];
    case "300C":
      return ["300C", "더뉴", "올뉴"];
    case "보이저":
      return ["보이저", "그랜드", "뉴 그랜드", "플리머스"];
    case "캐러밴":
      return ["그랜드", "캐러밴"];
    case "E":
      return ["E150", "E350", "E450"];
    case "F":
      return ["F150", "F350", "F450"];
    case "익스플로러":
      return ["익스플로러", "6세대"];
    case "MKS":
      return ["뉴", "MKS"];
    case "MKX":
      return ["MKX", "2세대", "뉴"];
    case "링컨 컨티넨탈":
      return ["뉴", "컨티넨탈", "10세대"];
    case "CTS":
      return ["CTS 1세대", "CTS 2세대", "CTS 3세대", "CTS-V"];
    case "체로키":
      return ["그랜드", "그랜드 L", "올 뉴 그랜드", "체로키"];
    case "206":
      return ["206", "206CC", "206RC", "206SW"];
    case "207":
      return ["207CC", "207GT", "207RC", "207SW"];
    case "208":
      return ["208", "e-208"];
    case "307":
      return ["307", "307CC", "307SW"];
    case "308":
      return ["308", "308CC", "308GT", "308SW"];
    case "407":
      return ["407", "407SW", "407쿠페"];
    case "508":
      return ["508", "508 RXH", "508GT", "508SW"];
    case "XJ":
      return ["XJ", "XJ-6", "XJ-8", "XJR", "XJS", "뉴", "올뉴"];
    case "XK":
      return ["XK", "XK8", "XKR", "XKR-S"];
    case "컨트리맨":
      return [
        "쿠퍼 컨트리맨",
        "쿠퍼D 컨트리맨",
        "쿠퍼S 컨트리맨",
        "쿠퍼SD 컨트리맨",
      ];
    case "쿠퍼":
      return ["원", "쿠퍼", "쿠퍼D", "쿠퍼S", "쿠퍼SD"];
    case "쿠퍼 로드스터":
      return ["쿠퍼 로드스터", "쿠퍼S 로드스터"];
    case "쿠퍼 컨버터블":
      return ["쿠퍼 컨버터블", "쿠퍼S 컨버터블"];
    case "미니 쿠페":
      return ["쿠페", "쿠페S", "쿠페SD"];
    case "클럽맨":
      return ["쿠페 클럽맨", "쿠페D 클럽맨", "쿠페S 클럽맨", "쿠페SD 클럽맨"];
    case "페이스맨":
      return ["쿠퍼D 페이스맨", "쿠퍼SD 페이스맨"];
    case "디스커버리":
      return [
        "디스커버리 스포츠",
        "디스커버리",
        "디스커버리2",
        "디스커버리3",
        "디스커버리4",
        "디스커버리5",
      ];
    case "레인지로버":
      return ["레인지로버", "4세대"];
    case "이보크":
      return ["이보크", "2세대"];
    case "프리랜더":
      return ["프리랜더", "프리랜더2"];
    case "컨티넨탈":
      return ["뉴", "컨티넨탈", "10세대"];
    case "플라잉스퍼":
      return ["1세대", "2세대", "3세대"];
    case "DB":
      return ["DB11", "DB7", "DB9"];
    case "밴티지":
      return ["V12", "V8", "2세대"];
    case "뱅퀴시":
      return ["뱅퀴시", "뱅퀴시 S"];
    case "488":
      return ["488 GTB", "488 스파이더", "488 피스타"];
    case "512":
      return ["512M", "512TR"];
    case "599":
      return ["599 GTB", "599 GTO", "599XX"];
    case "812":
      return ["812GTS", "812슈퍼패스트"];
    case "F12":
      return ["F12 TDF", "F12 베를리네타"];
    case "F8":
      return ["F8 스파이더", "F8 트리뷰토"];
    case "500":
      return [
        "500",
        "500C",
        "500L",
        "500아바스",
        "500아바스 595",
        "500아바스 695",
        "500쿠페",
      ];
    case "피아트 쿠페":
      return ["피아트 쿠페", "피아트 쿠페S", "피아트 쿠페SD"];
    case "고소작업차":
      return ["2.5톤이하", "3톤이상"];
    case "바가지차":
      return ["2.5톤이하", "4톤이상"];
    case "사다리":
      return ["대림", "드림", "세인", "신한", "천하", "하나", "호룡"];
    case "집게차":
      return ["5톤이하", "9.5톤이상"];
    case "카고크레인":
      return ["크레인"];
    case "덤프":
      return [
        "기타",
        "라이노4.5톤",
        "라이노5.5톤",
        "라이노5톤",
        "마이티2.5톤",
        "마이티3.5톤",
        "복사4톤",
        "타이탄2.5톤",
        "트레이드2.5톤",
        "파맥스2.5톤",
        "파맥스3.5톤",
        "프런티어2.5톤",
        "현대2.5톤",
        "현대4.5톤",
        "현대5톤",
      ];
    case "렉카":
      return ["국제", "라이노", "마이티", "반도", "수산", "수성", "현대"];
    case "셀프로더":
      return ["4.5톤이하", "5톤이상"];
    case "언더리프트":
      return ["1톤", "2.5톤"];
    case "기타액체운반":
      return ["기타", "물차", "바큠로리", "살수차", "소방차"];
    case "버큠로리":
      return ["2.5톤", "25톤", "3.5톤", "4.5톤", "5톤"];
    case "탱크로리":
      return ["3.5톤", "4.5톤", "5톤", "6톤이상"];
    case "홍로리":
      return [
        "3.5톤",
        "마이티2.5톤",
        "부영",
        "점보타이탄",
        "트레이드2.5톤",
        "파맥스2.5톤",
        "프런티어2.5톤",
      ];
    case "암롤트럭":
      return ["기아", "대우", "수입", "현대"];
    case "진개차":
      return ["기타", "압착식", "압축식", "진개덤프"];
    case "2.5톤":
      return ["마이티", "타이탄", "트레이드", "파맥스", "프런티어", "현대"];
    case "2톤":
      return ["마이티"];
    case "3.5톤~4톤":
      return [
        "더쎈",
        "라이노4톤",
        "마이티3.5톤",
        "와이드복사4톤",
        "파맥스3.5톤",
        "현대3.5톤",
        "현대4톤",
      ];
    case "4.5톤~5톤":
      return [
        "대우4.5톤",
        "대우5톤",
        "라이노4.5톤",
        "라이노5톤",
        "만트럭4.5톤",
        "메가트럭4.5톤",
        "메가트럭5톤",
        "볼보4.5톤",
        "현대4.5톤",
        "현대5톤",
        "히노4.5톤",
      ];
    case "5.5이상":
      return ["10.5~15톤", "15.5~20톤", "20.5톤이상", "5.5~10톤"];
    case "내장탑":
      return ["2톤", "2.5톤", "3.5톤", "4톤", "4.5톤", "5톤이상"];
    case "냉동탑":
      return ["2톤", "2.5톤", "3.5톤", "4.5톤", "5톤이상"];
    case "냉장탑":
      return ["2톤", "2.5톤", "3.5톤", "4.5톤", "5톤이상"];
    case "보냉탑":
      return ["2.5톤", "3.5톤", "4.5톤", "5톤이상"];
    case "윙바디":
      return ["2톤", "2.5톤", "3.5톤", "4.5톤", "5톤", "5.5톤이상"];
    case "익스탑":
      return ["2톤", "2.5톤", "3.5톤", "4.5톤", "5톤"];
    case "파워게이트":
      return [
        "1톤",
        "1.2톤",
        "1.4톤",
        "2톤",
        "2.5톤",
        "3.5톤",
        "4.5톤",
        "5톤이상",
      ];
    case "하이내장탑":
      return ["2.5톤", "3.5톤"];
    case "트랙터":
      return [
        "기아",
        "현대",
        "대우",
        "만",
        "벤츠",
        "볼보",
        "삼성",
        "스카니아",
        "쌍용",
        "이베코",
        "인터내셔널",
      ];
    case "캠핑운송트레일러":
      return ["SM캠핑운송트레일러", "나마스떄", "세정", "코쿤", "포레스트리버"];
    case "콘테이너샤시":
      return ["K1", "미래", "쌍용", "진도", "한특", "현대"];
    case "트레일러":
      return [
        "대우",
        "두성",
        "쌍용",
        "인정",
        "진도",
        "진명",
        "한국",
        "한원",
        "현대",
      ];
    case "가축운반차":
      return ["4.5톤이상"];
    case "곡물수송차":
      return ["4.5톤이상", "5톤이상"];
    case "문서파쇄압축차량":
      return ["4.5톤이상", "5톤이상"];
    case "방재차":
      return ["방재차"];
    case "사료운반차":
      return ["5톤이상"];
    case "왕겨및톱밥운송":
      return ["5톤이상"];
    case "음식물처리차량":
      return ["3.5톤", "4.5톤", "5톤이상"];
    case "이동목욕차":
      return ["2.5톤", "3.5톤", "4.5톤"];
    case "이동세탁차":
      return ["2.5톤", "3.5톤", "4.5톤"];
    case "이동무대차":
      return [value];
    case "청소차":
      return ["노면청소차", "압축진개차", "하수부 준설차"];
    case "카캐리어":
      return ["4.5톤이하", "5톤이상"];
    case "캠핑카":
      return [value, "캠핑트레일러"];
    case "활어차":
      return ["2.5톤", "3톤이상"];

    default:
      return [value];
  }
}
